import { MapSchema, Schema, type } from "@colyseus/schema";
import { Player } from "./player";
import { RoundState } from "./RoundState";

export class GameState extends Schema {
  @type({array: Player})
  players: Player[] = [
    new Player('', [42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 53, 54, 55, 56, 57, 58]),
    new Player('', [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 59, 60, 61, 62, 63, 64]),
    new Player('', [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 65, 66, 67, 68, 69, 70]),
    new Player('', [29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 71, 72, 73, 74, 75, 76])]

  /**
   * 当前是谁的回合，对应 players 的下标
   */
  @type('number')
  round: number = 0

  /**
   * 当前回合的状态
   */
  @type('number')
  roundState: RoundState = RoundState.WAITING

  /**
   * 当前骰子的点数，因为可以掷多次（当掷到6时）
   */
  @type({array: 'number'})
  diceValues: number[] = []
}